## Importación de Librerías

In [1]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np
from connDef import *

### Obtención de datos e inserción a dataframes

In [2]:
# Conexión a la base de datos.

conn = dbconn()

db connected


Read SQL -> df = pd.read_sql(con <connection>, sql = db.text(<query>) )

In [3]:
query = db.text('SELECT * FROM DcDataLakeDB.CoffeShopData')
coffeData = pd.read_sql(con = conn.connect(), sql = query)

In [4]:
query = db.text('SELECT * FROM DcDataLakeDB.Customer')
Customer = pd.read_sql(con = conn.connect(), sql = query)

In [5]:
query = db.text('SELECT * FROM DcDataLakeDB.Dates')
dates = pd.read_sql(con = conn.connect(), sql = query)

In [6]:
query = db.text('SELECT * FROM DcDataLakeDB.Generations')
generations = pd.read_sql(con = conn.connect(), sql = query)

In [7]:
query = db.text('SELECT * FROM DcDataLakeDB.Pastry_inventory')
pastryInventory = pd.read_sql(con = conn.connect(), sql = query)

In [8]:
query = db.text('SELECT * FROM DcDataLakeDB.Product')
product = pd.read_sql(con = conn.connect(), sql = query)

In [9]:
query = db.text('SELECT * FROM DcDataLakeDB.Sales_target')
salesTarget = pd.read_sql(con = conn.connect(), sql = query)

In [10]:
query = db.text('SELECT * FROM DcDataLakeDB.SalesOutlet')
salesOutlet = pd.read_sql(con = conn.connect(), sql = query)

In [11]:
query = db.text('SELECT * FROM DcDataLakeDB.Staff')
staff = pd.read_sql(con = conn.connect(), sql = query)

In [12]:
product.head(10)

,product_id,product_group,product_category,product_type,product,product_description,unit_of_measure,current_wholesale_price,current_retail_price,tax_exempt_yn,promo_yn,new_product_yn
0,1,Whole Bean/Teas,Coffee beans,Organic Beans,Brazilian - Organic,It's like Carnival in a cup. Clean and smooth.,12 oz,14.40,$18.00,Y,0,0
1,2,Whole Bean/Teas,Coffee beans,House blend Beans,Our Old Time Diner Blend,Out packed blend of beans that is reminiscent ...,12 oz,14.40,$18.00,Y,0,0
2,3,Whole Bean/Teas,Coffee beans,Espresso Beans,Espresso Roast,Our house blend for a good espresso shot.,1 lb,11.80,$14.75,Y,0,0
3,4,Whole Bean/Teas,Coffee beans,Espresso Beans,Primo Espresso Roast,Our primium single source of hand roasted beans.,1 lb,16.36,$20.45,Y,0,0
4,5,Whole Bean/Teas,Coffee beans,Gourmet Beans,Columbian Medium Roast,A smooth cup of coffee any time of day.,1 lb,12.00,$15.00,Y,0,0
5,6,Whole Bean/Teas,Coffee beans,Gourmet Beans,Ethiopia,From the home of coffee.,1 lb,16.80,$21.00,Y,0,0
6,7,Whole Bean/Teas,Coffee beans,Premium Beans,Jamacian Coffee River,"Ya man, it will start your day off right.",1 lb,15.80,$19.75,Y,0,0
7,8,Whole Bean/Teas,Coffee beans,Premium Beans,Civet Cat,"The most expensive coffee in the world, the ca...",.5 lb,36.00,$45.00,Y,0,0
8,9,Whole Bean/Teas,Coffee beans,Organic Beans,Organic Decaf Blend,Our blend of hand picked organic beans that ha...,1 lb,18.00,$22.50,Y,0,0
9,10,Whole Bean/Teas,Coffee beans,Green beans,Guatemalan Sustainably Grown,Green beans you can roast yourself.,1 lb,8.00,$10.00,Y,0,0

## SuperData Dataframe

JOIN DATAFRAMES:
- coffedata
- customer
- dates 
- product
- sales outlet

In [13]:
coffeData.head(3)

,transaction_id,transaction_date,transaction_time,sales_outlet_id,staff_id,customer_id,instore_yn,orders,line_item_id,product_id,quantity,line_item_amount,unit_price,promo_item
0,7,01/04/2019,12:04:43,3,12,558,N,1,1,52,1,2.5,2.5,N
1,11,01/04/2019,15:54:39,3,17,781,N,1,1,27,2,7.0,3.5,N
2,19,01/04/2019,14:34:59,3,17,788,Y,1,1,46,2,5.0,2.5,N

In [14]:
superData = coffeData.join(dates.set_index('transaction_date'), on='transaction_date')

In [15]:
superData = superData.join(product.set_index('product_id') ,on='product_id')

In [16]:
superData = superData.join(salesOutlet.set_index('sales_outlet_id'), on='sales_outlet_id')

In [17]:
superData = superData.join(Customer.set_index('customer_id'), on='customer_id')

In [18]:
superData.shape

(49894, 52)

In [19]:
superData[['current_retail_price', 'unit_price']].head(2)

  current_retail_price  unit_price
0               $2.50          2.5
1               $3.50          3.5

In [20]:
#superData = superData.drop(columns = ['promo_yn', 'unit_price'])

In [21]:
superData.columns

Index(['transaction_id', 'transaction_date', 'transaction_time',
       'sales_outlet_id', 'staff_id', 'customer_id', 'instore_yn', 'orders',
       'line_item_id', 'product_id', 'quantity', 'line_item_amount',
       'unit_price', 'promo_item', 'date_id', 'week_id', 'week_desc',
       'month_id', 'month_name', 'quarter_id', 'quarter_name', 'year_id',
       'product_group', 'product_category', 'product_type', 'product',
       'product_description', 'unit_of_measure', 'current_wholesale_price',
       'current_retail_price', 'tax_exempt_yn', 'promo_yn', 'new_product_yn',
       'sales_outlet_type', 'store_square_feet', 'store_address', 'store_city',
       'store_state_province', 'store_telephone', 'store_postal_code',
       'store_longitude', 'store_latitude', 'manager', 'neighborhood',
       'home_store', 'customer_first_name', 'customer_email', 'customer_since',
       'loyalty_card_number', 'birthdate', 'gender', 'birth_year'],
      dtype='object')

In [22]:
superData[['transaction_id', 'promo_yn', 'current_retail_price', 'unit_price', 'promo_item']]

       transaction_id  promo_yn current_retail_price  unit_price promo_item
0                   7         0               $2.50         2.50          N
1                  11         0               $3.50         3.50          N
2                  19         0               $2.50         2.50          N
3                  32         0               $2.50         2.50          N
4                  33         0               $2.45         2.45          N
...               ...       ...                  ...         ...        ...
49889             753         0               $3.00         3.00          N
49890             756         0               $2.20         2.20          N
49891             759         0               $2.20         2.20          N
49892             763         0               $2.50         2.50          N
49893             763         0               $3.25         3.50          N

[49894 rows x 5 columns]

## Engineering

### Feature Engineering:

- [X] 1.- Customers by day by store
- [X] 2.- Volume by day by store
- [X] 3.- Average price per item by store
- [X] 4.- Loyalty binary 0 1
- [X] 5.- Average price by product group
- [X] 6.- Total volume by customer by store
- [X] 7.- Total revenue by customer by store
- [X] 8.- Before midday, aftermiday binary columns 0 1
- [X] 9.- Proportion of sales in store by store
- [X] 10.- Number of orders by store by day
- [X] 11.- Number of products sold by store
- [ ] 12.- Proportion of items in promo by store
- [X] 13.- Proportion of customer with loyalty by store
- [ ] 14.- Transaction in promotion binary 0 1

#### 1.- Customers by day by store

In [24]:
#Non repeated customers by transaction, day and sales outlet
df = superData.loc[:,['sales_outlet_id','transaction_id', 'transaction_date','customer_id']]
df.drop_duplicates(subset=['sales_outlet_id','transaction_id', 'transaction_date'], inplace=True)
df = df.groupby(['sales_outlet_id', 'transaction_date'])['customer_id'].sum().reset_index(name='total_customers')
df

    sales_outlet_id transaction_date  total_customers
0                 3       01/04/2019           202505
1                 3       02/04/2019           207367
2                 3       03/04/2019           216071
3                 3       04/04/2019           190911
4                 3       05/04/2019           208199
..              ...              ...              ...
82                8       25/04/2019          1352672
83                8       26/04/2019          1287019
84                8       27/04/2019          1206656
85                8       28/04/2019          1072865
86                8       29/04/2019          1047949

[87 rows x 3 columns]

#### 2-. Volume by day by store

In [25]:
df = superData.groupby(['transaction_date', 'sales_outlet_id'])['product_id'].unique().apply(lambda x : len(x)).reset_index(name='unique_selling')

In [26]:
df

   transaction_date  sales_outlet_id  unique_selling
0        01/04/2019                3              51
1        01/04/2019                5              52
2        01/04/2019                8              51
3        02/04/2019                3              51
4        02/04/2019                5              52
..              ...              ...             ...
82       28/04/2019                5              52
83       28/04/2019                8              52
84       29/04/2019                3              51
85       29/04/2019                5              52
86       29/04/2019                8              52

[87 rows x 3 columns]

#### 3.-Average price per product by store

In [27]:
superData.columns

Index(['transaction_id', 'transaction_date', 'transaction_time',
       'sales_outlet_id', 'staff_id', 'customer_id', 'instore_yn', 'orders',
       'line_item_id', 'product_id', 'quantity', 'line_item_amount',
       'unit_price', 'promo_item', 'date_id', 'week_id', 'week_desc',
       'month_id', 'month_name', 'quarter_id', 'quarter_name', 'year_id',
       'product_group', 'product_category', 'product_type', 'product',
       'product_description', 'unit_of_measure', 'current_wholesale_price',
       'current_retail_price', 'tax_exempt_yn', 'promo_yn', 'new_product_yn',
       'sales_outlet_type', 'store_square_feet', 'store_address', 'store_city',
       'store_state_province', 'store_telephone', 'store_postal_code',
       'store_longitude', 'store_latitude', 'manager', 'neighborhood',
       'home_store', 'customer_first_name', 'customer_email', 'customer_since',
       'loyalty_card_number', 'birthdate', 'gender', 'birth_year'],
      dtype='object')

In [28]:
superData['current_retail_price'].str.replace('$', '', regex=True).astype(float).head(5)

0    2.50
1    3.50
2    2.50
3    2.50
4    2.45
Name: current_retail_price, dtype: float64

In [29]:
superData['sales_outlet_id'].value_counts()

8    17071
3    16829
5    15994
Name: sales_outlet_id, dtype: int64

In [30]:
#Current_retail_price
df = superData.loc[:, ['product', 'sales_outlet_id']]
df['current_retail_price'] = superData['current_retail_price'].str.replace('$', '', regex=True).astype(float)
df = df.groupby(['product', 'sales_outlet_id'])['current_retail_price'].mean().reset_index(name='average_retail_price')
df.head(10)

               product  sales_outlet_id  average_retail_price
0     Almond Croissant                3                  3.75
1     Almond Croissant                5                  3.75
2     Almond Croissant                8                  3.75
3  Brazilian - Organic                3                 18.00
4  Brazilian - Organic                5                 18.00
5  Brazilian - Organic                8                 18.00
6         Brazilian Lg                3                  3.50
7         Brazilian Lg                5                  3.50
8         Brazilian Lg                8                  3.50
9         Brazilian Rg                3                  3.00

In [31]:
superData['current_wholesale_price'].head(2)

0    0.63
1    0.70
Name: current_wholesale_price, dtype: float64

In [32]:
#Current wholesale price
df = superData.groupby(['product', 'sales_outlet_id'])['current_wholesale_price'].mean().reset_index(name='average_wholesale_price')
df.head(10)

               product  sales_outlet_id  average_wholesale_price
0     Almond Croissant                3                     2.44
1     Almond Croissant                5                     2.44
2     Almond Croissant                8                     2.44
3  Brazilian - Organic                3                    14.40
4  Brazilian - Organic                5                    14.40
5  Brazilian - Organic                8                    14.40
6         Brazilian Lg                3                     0.70
7         Brazilian Lg                5                     0.70
8         Brazilian Lg                8                     0.70
9         Brazilian Rg                3                     0.60

#### 4.- Loyalty binary 0 1

In [33]:
superData['loyalty_card_number'].isnull().sum()

25042

In [34]:
#Loyalty binary 0 1
df = superData.loc[:,['transaction_id', 'loyalty_card_number']]
df['Loyalty'] = df['loyalty_card_number'].notnull().astype(int)
df.drop(['loyalty_card_number'], axis=1, inplace=True)
df.head(5)

   transaction_id  Loyalty
0               7        1
1              11        1
2              19        1
3              32        1
4              33        1

In [35]:
df[df['Loyalty'] == 0].value_counts().sum()

25042

#### 5.-Average price by product group

In [36]:
#Current retail price
df = superData.loc[:, ['product_id','product', 'product_group']]
df['current_retail_price'] = superData['current_retail_price'].str.replace('$', '', regex=True).astype(float)
df.head(1)

   product_id                    product product_group  current_retail_price
0          52  Traditional Blend Chai Rg     Beverages                   2.5

In [37]:
df = df.groupby(['product_group'])['current_retail_price'].mean().reset_index(name='average_retail_price')
df.head(10)

     product_group  average_retail_price
0          Add-ons              0.800000
1        Beverages              3.061532
2             Food              3.551536
3      Merchandise             17.951020
4  Whole Bean/Teas             15.359306

In [38]:
#Current wholesale price
df = superData.groupby(['product_group'])['current_wholesale_price'].mean().reset_index(name='average_wholesale_price')
df.head(10)

     product_group  average_wholesale_price
0          Add-ons                 0.040000
1        Beverages                 0.895076
2             Food                 2.310242
3      Merchandise                 5.744327
4  Whole Bean/Teas                12.287270

#### 6.- Total volume by customer by store

In [39]:
df = superData.groupby(['sales_outlet_id','customer_id'])['quantity'].sum().reset_index(name='total_volume')
df.head(10)

   sales_outlet_id  customer_id  total_volume
0                3            0         11581
1                3            1            11
2                3            2            27
3                3            3            45
4                3            4            10
5                3            5             8
6                3            6            15
7                3            7            17
8                3            8            21
9                3            9            16

#### 7.-Total revenue by customer by store

In [40]:
df = superData.loc[:,['transaction_id', 'customer_id', 'sales_outlet_id', 'quantity', 'unit_price']]
df['total'] = df['quantity'] * df['unit_price']
df.head(3)

   transaction_id  customer_id  sales_outlet_id  quantity  unit_price  total
0               7          558                3         1         2.5    2.5
1              11          781                3         2         3.5    7.0
2              19          788                3         2         2.5    5.0

In [41]:
df = df.groupby(['sales_outlet_id', 'customer_id'])['total'].sum().reset_index(name='revenue')
df.head(3)

   sales_outlet_id  customer_id   revenue
0                3            0  38788.39
1                3            1     29.20
2                3            2     90.35

#### 8.-Before midday, aftermiday binary columns 0 1

In [42]:
superData['transaction_time'].head(3)

0    12:04:43
1    15:54:39
2    14:34:59
Name: transaction_time, dtype: object

In [43]:
df = superData.loc[:, ['transaction_id', 'transaction_time']]
df['transaction_time'] = pd.to_datetime(df['transaction_time'])
df['transaction_time'].head(5)

0   2023-03-10 12:04:43
1   2023-03-10 15:54:39
2   2023-03-10 14:34:59
3   2023-03-10 16:06:04
4   2023-03-10 19:18:37
Name: transaction_time, dtype: datetime64[ns]

In [44]:
df['binary_midday'] = (df['transaction_time'].dt.hour >= 12 ).astype(int)
df.drop('transaction_time', axis=1, inplace=True)
df.head(5)

   transaction_id  binary_midday
0               7              1
1              11              1
2              19              1
3              32              1
4              33              1

#### 9.- Proportion of sales in store by store

In [45]:
superData['instore_yn'].head(3)

0    N
1    N
2    Y
Name: instore_yn, dtype: object

In [46]:
df_online = superData.groupby('sales_outlet_id', group_keys=True)['instore_yn'].apply(lambda x: (x == 'Y').sum())
df_offline = superData.groupby('sales_outlet_id', group_keys=True)['instore_yn'].apply(lambda x: (x == 'N').sum())
df_prop_on = df_online / (df_online + df_offline)
df_prop_of = df_offline / (df_online + df_offline)
df = pd.concat([df_prop_on, df_prop_of], axis=1)
df.columns = [['in_store', 'online']]
df

                 in_store    online
sales_outlet_id
3                0.505556  0.494444
5                0.500813  0.499187
8                0.505096  0.494904

#### 10.-Number of orders by store by day

In [47]:
#Repeated transactions
df = superData.groupby(['sales_outlet_id','transaction_date'])['transaction_id'].size().reset_index(name='total_transactions')
df.head(5)

   sales_outlet_id transaction_date  total_transactions
0                3       01/04/2019                 584
1                3       02/04/2019                 604
2                3       03/04/2019                 620
3                3       04/04/2019                 571
4                3       05/04/2019                 601

In [48]:
print(df.shape)
print(df['total_transactions'].sum())

(87, 3)
49894

In [49]:
#delete repeated transactions in the same outlet and date
df = superData.loc[:,['sales_outlet_id', 'transaction_id', 'transaction_date']]
df.drop_duplicates(subset=['sales_outlet_id','transaction_id', 'transaction_date'], inplace=True)
df = df.groupby(['sales_outlet_id','transaction_date'])['transaction_id'].size().reset_index(name='total_transactions')
df.head(5)

   sales_outlet_id transaction_date  total_transactions
0                3       01/04/2019                 508
1                3       02/04/2019                 512
2                3       03/04/2019                 540
3                3       04/04/2019                 488
4                3       05/04/2019                 513

In [50]:
print(df.shape)
print(df['total_transactions'].sum())

(87, 3)
39271

#### 11.- Number of products sold by store

In [51]:
df = superData.groupby(['sales_outlet_id'])['quantity'].sum().reset_index(name='quantity')
df.head(10)

   sales_outlet_id  quantity
0                3     23620
1                5     24029
2                8     24109

#### 12.-Proportion of items in promo by store

##### analysis

In [52]:
superData.columns

Index(['transaction_id', 'transaction_date', 'transaction_time',
       'sales_outlet_id', 'staff_id', 'customer_id', 'instore_yn', 'orders',
       'line_item_id', 'product_id', 'quantity', 'line_item_amount',
       'unit_price', 'promo_item', 'date_id', 'week_id', 'week_desc',
       'month_id', 'month_name', 'quarter_id', 'quarter_name', 'year_id',
       'product_group', 'product_category', 'product_type', 'product',
       'product_description', 'unit_of_measure', 'current_wholesale_price',
       'current_retail_price', 'tax_exempt_yn', 'promo_yn', 'new_product_yn',
       'sales_outlet_type', 'store_square_feet', 'store_address', 'store_city',
       'store_state_province', 'store_telephone', 'store_postal_code',
       'store_longitude', 'store_latitude', 'manager', 'neighborhood',
       'home_store', 'customer_first_name', 'customer_email', 'customer_since',
       'loyalty_card_number', 'birthdate', 'gender', 'birth_year'],
      dtype='object')

In [53]:
df =superData.loc[:, ['transaction_id', 'promo_item', 'promo_yn']]

In [54]:
df['promo_yn'].isnull().any()

False

In [55]:
df['promo_item'].isnull().any()

False

In [56]:
df['promo_item'] = df['promo_item'].map({'Y':1, 'N':0})

In [57]:
superData[superData['promo_yn'] == 1]

Empty DataFrame
Columns: [transaction_id, transaction_date, transaction_time, sales_outlet_id, staff_id, customer_id, instore_yn, orders, line_item_id, product_id, quantity, line_item_amount, unit_price, promo_item, date_id, week_id, week_desc, month_id, month_name, quarter_id, quarter_name, year_id, product_group, product_category, product_type, product, product_description, unit_of_measure, current_wholesale_price, current_retail_price, tax_exempt_yn, promo_yn, new_product_yn, sales_outlet_type, store_square_feet, store_address, store_city, store_state_province, store_telephone, store_postal_code, store_longitude, store_latitude, manager, neighborhood, home_store, customer_first_name, customer_email, customer_since, loyalty_card_number, birthdate, gender, birth_year]
Index: []

[0 rows x 52 columns]

In [58]:
mask = df['promo_item'] != df['promo_yn']
df[mask]

       transaction_id  promo_item  promo_yn
24973               5           1         0
24974               5           1         0
25024             153           1         0
25025             153           1         0
25088             363           1         0
...               ...         ...       ...
49692             401           1         0
49754             490           1         0
49777             537           1         0
49878             729           1         0
49888             752           1         0

[490 rows x 3 columns]

In [67]:
df_promo = superData.groupby('sales_outlet_id', group_keys=True)['promo_item'].apply(lambda x: (x=='Y').sum())
df_notpromo = superData.groupby('sales_outlet_id', group_keys=True)['promo_item'].apply(lambda x: (x=='N').sum())
df = df_promo / (df_promo + df_notpromo)
df.columns = ['promo_proportion']
df.head(10)

sales_outlet_id
3    0.000000
5    0.011129
8    0.018277
Name: promo_item, dtype: float64

#### 13.- Proportion of customer with loyalty by store

In [59]:
df_loyalty = superData.groupby('sales_outlet_id', group_keys=True)['loyalty_card_number'].apply(lambda x: x.notnull().sum())
df_notloyalty = superData.groupby('sales_outlet_id', group_keys=True)['loyalty_card_number'].apply(lambda x: x.isnull().sum())
df = df_loyalty / (df_loyalty + df_notloyalty)
df.columns = ['loyalty_proportion']
df.head(10)

sales_outlet_id
3    0.510607
5    0.534263
8    0.451877
Name: loyalty_card_number, dtype: float64

#### 14.- Transaction in promotion binary 1 0

In [72]:
df = superData.loc[:, ['transaction_id', 'promo_item']]
df['promo_item'] = df['promo_item'].map({'Y':1, 'N':0})
df.head(10)

   transaction_id  promo_item
0               7           0
1              11           0
2              19           0
3              32           0
4              33           0
5              39           0
6              50           0
7              53           0
8              59           0
9              62           0